app/views/home/home.html.erb

  <div id="menu">
    <% Section.all.each do |section| %>
---
SELECT "sections".* FROM "sections"


            <% articles = News.all %>
---
SELECT "news".* FROM "news" ORDER BY "news"."id" DESC LIMIT 1

                    <div style="font-style: italic; font-size: 11px; color: #555555;">Created
                      by <%= User.find(last_article.created_by).username %></div>
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]