app/views/pages/modify.html.erb

SELECT "pages".* FROM "pages" WHERE "pages"."section_id" = 1 AND "pages"."id" = ? ORDER BY position LIMIT 1  [["id", "1"]]
---
      <% if @method == "Add" %>
          <%= f.hidden_field :position, :value => (largest_position(@section.pages.all) + 1).to_s %>