app/views/administrator/news.html.erb

SELECT "sections".* FROM "sections" WHERE "sections"."id" = ? LIMIT 1  [["id", 1]]
---
          <td class="tr_table"><%= list[i].short_description %></td>
          <td class="tr_table"><%= Section.find(list[i].category).name %></td>