app/views/administrator/pages.html.erb


    <% list = @section.pages.all %>
---
SELECT "pages".* FROM "pages" WHERE "pages"."section_id" = 2 ORDER BY position