app/controllers/administrator_controller.rb

SELECT "sections".* FROM "sections" WHERE "sections"."id" = ? LIMIT 1  [["id", "2"]]
---
  def pages

    @section = Section.find(params[:section])