app/controllers/news_controller.rb

SELECT "news".* FROM "news" ORDER BY "news"."id" DESC LIMIT 1
SELECT COUNT(*) FROM "news"
---
  def new
    @news = News.new
    @news.front_page = true
    if (News.count > 0)

INSERT INTO "news" ("alias", "category", "created_at", "created_by", "front_page", "long_description", "short_description", "tags", "title", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @news = News.new(params[:news])
    @news.created_by = current_user.id

SELECT "news".* FROM "news" WHERE "news"."id" = ? LIMIT 1  [["id", "3"]]
---
  def edit
    @news = News.find(params[:id])

SELECT "news".* FROM "news" WHERE "news"."id" = ? LIMIT 1  [["id", "3"]]
UPDATE "news" SET "front_page" = 'f', "updated_at" = '2012-04-30 21:21:01.451426' WHERE "news"."id" = 3
---
  def update
    @news = News.find(params[:id])
    if @news.update_attributes(params[:news])

SELECT "news".* FROM "news" WHERE "news"."id" = ? LIMIT 1  [["id", "1"]]
DELETE FROM "news" WHERE "news"."id" = ?  [["id", 1]]
---
  def destroy
    @news = News.find(params[:id])
    if !@news.nil?
      @news.destroy