app/controllers/page_controller.rb

  def page
    sec = Section.find_by_alias(params[:section])
    if !sec.nil?

      @submenu = sec

      page = sec.pages.find_by_alias(params[:page])
---
SELECT "sections".* FROM "sections" WHERE "sections"."alias" = 'course' LIMIT 1
SELECT "pages".* FROM "pages" WHERE "pages"."section_id" = 1 AND "pages"."alias" = 'scholarships' ORDER BY position LIMIT 1

  def home
    sec = Section.find_by_alias(params[:section])
    if !sec.nil?

      @submenu = sec

      page = sec.pages.find_by_alias(sec.home)
---
SELECT "sections".* FROM "sections" WHERE "sections"."alias" = 'course' LIMIT 1
SELECT "pages".* FROM "pages" WHERE "pages"."section_id" = 1 AND "pages"."alias" = 'home' ORDER BY position LIMIT 1