app/controllers/pages_controller.rb

SELECT "sections".* FROM "sections" WHERE "sections"."id" = ? LIMIT 1  [["id", "2"]]
---
  def new
    @section = Section.find(params[:section_id])

SELECT "sections".* FROM "sections" WHERE "sections"."id" = ? LIMIT 1  [["id", "4"]]
INSERT INTO "pages" ("alias", "content", "created_at", "description", "name", "position", "section_id", "updated_at", "visible") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @section = Section.find(params[:section_id])
    if @section.pages.create!(params[:page])

SELECT "sections".* FROM "sections" WHERE "sections"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "pages".* FROM "pages" WHERE "pages"."section_id" = 1 AND "pages"."id" = ? ORDER BY position LIMIT 1  [["id", "1"]]
---
  def edit
    @section = Section.find(params[:section_id])
    if !@section.nil?
      @method = "Modify"
      @page = @section.pages.find(params[:id])

SELECT "sections".* FROM "sections" WHERE "sections"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "pages".* FROM "pages" WHERE "pages"."section_id" = 1 AND "pages"."id" = ? ORDER BY position LIMIT 1  [["id", "1"]]
UPDATE "pages" SET "content" = '<p>Welcome to the CS Courses page.<br /><br />Please select a place from the links to the left.</p>
---
  def update
    @section = Section.find(params[:section_id])
    @page = @section.pages.find(params[:id])
    if @page.update_attributes(params[:page])

SELECT "sections".* FROM "sections" WHERE "sections"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "pages".* FROM "pages" WHERE "pages"."section_id" = 1 AND "pages"."id" = ? ORDER BY position LIMIT 1  [["id", "1"]]
SELECT "pages".* FROM "pages" WHERE "pages"."section_id" = 1 AND "pages"."position" = 3 ORDER BY position LIMIT 1
UPDATE "pages" SET "position" = 3, "updated_at" = '2012-04-29 02:57:59.201123' WHERE "pages"."id" = 2
---
  def move_up
    @section = Section.find(params[:section])
    if (!@section.nil?)
      page = @section.pages.find(params[:page])
      if (!page.nil?)
        if (page.position != 1)
          current_position = page.position.to_i
          new_position = current_position - 1
          @section.pages.find_by_position(new_position).update_attributes(position: current_position)

SELECT "sections".* FROM "sections" WHERE "sections"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "pages".* FROM "pages" WHERE "pages"."section_id" = 1 AND "pages"."id" = ? ORDER BY position LIMIT 1  [["id", "3"]]
SELECT COUNT(*) FROM "pages" WHERE "pages"."section_id" = 1
SELECT "pages".* FROM "pages" WHERE "pages"."section_id" = 1 AND "pages"."position" = 3 ORDER BY position LIMIT 1
UPDATE "pages" SET "position" = 2, "updated_at" = '2012-04-29 03:01:02.519608' WHERE "pages"."id" = 2
---
  def move_down
    @section = Section.find(params[:section])
    if (!@section.nil?)
      page = @section.pages.find(params[:page])
      if (!page.nil?)
        if page.position != @section.pages.size
          current_position = page.position
          new_position = current_position + 1
          @section.pages.find_by_position(new_position).update_attributes(position: current_position)