app/controllers/sections_controller.rb

SELECT "sections".* FROM "sections" ORDER BY position
INSERT INTO "sections" ("alias", "created_at", "description", "home", "name", "position", "updated_at", "visible") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
INSERT INTO "pages" ("alias", "content", "created_at", "description", "name", "position", "section_id", "updated_at", "visible") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @section = Section.new(params[:section])
    pos = Section.all
    @section.position = largest_position(pos) + 1
    @section.home = "home"
    if @section.save
      @section.pages.create!(name: "Home", alias: "home", description: "Default home page.", content: "This is the default home page for the newly created section " + @section.name + "!<br/><br/>Edit this section to edit the home page or change the home page to an existing page though the edit menu.", visible: true, position: 1)

SELECT "sections".* FROM "sections" WHERE "sections"."id" = ? LIMIT 1  [["id", "1"]]
---
  def edit
    @section = Section.find(params[:id])

SELECT "sections".* FROM "sections" WHERE "sections"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "sections" SET "home" = 'iba', "visible" = '1', "updated_at" = '2012-04-28 23:44:59.046776' WHERE "sections"."id" = 2
---
  def update
    @section = Section.find(params[:id])
    if @section.update_attributes(params[:section])

SELECT "sections".* FROM "sections" WHERE "sections"."id" = ? LIMIT 1  [["id", "3"]]
SELECT "pages".* FROM "pages" WHERE "pages"."section_id" = 3 ORDER BY position
DELETE FROM "pages" WHERE "pages"."id" = ?  [["id", 14]]
DELETE FROM "sections" WHERE "sections"."id" = ?  [["id", 3]]
---
  def destroy
    @section = Section.find(params[:id])
    @section.pages.each do |page|
      page.destroy
    end
    @section.destroy

SELECT "sections".* FROM "sections" WHERE "sections"."id" = ? LIMIT 1  [["id", "2"]]
SELECT "sections".* FROM "sections" WHERE "sections"."position" = 2 LIMIT 1
UPDATE "sections" SET "position" = 3, "updated_at" = '2012-04-28 23:40:05.021959' WHERE "sections"."id" = 3
---
  def move_up
    section = Section.find(params[:section])
    if !section.nil?
      if section.position != 1
        current_position = section.position
        new_id = current_position - 1
        Section.find_by_position(new_id).update_attributes(position: current_position)

SELECT "sections".* FROM "sections" WHERE "sections"."id" = ? LIMIT 1  [["id", "2"]]
SELECT COUNT(*) FROM "sections"
SELECT "sections".* FROM "sections" WHERE "sections"."position" = 1 LIMIT 1
UPDATE "sections" SET "position" = 2, "updated_at" = '2012-04-28 23:34:59.952510' WHERE "sections"."id" = 1
---
  def move_down
    section = Section.find(params[:section])
    if !section.nil?
      if section.position != Section.count
        current_position = section.position
        new_id = current_position + 1
        Section.find_by_position(new_id).update_attributes(position: current_position)