app/controllers/sections_controller.rb

  def create
    @section = Section.new(params[:section])
    @section.position = Section.count + 1
---
SELECT COUNT(*) FROM "sections"